app/channels/chatroom_channel.rb

  def subscribed
    room = Room.find_by(id: params['room_id'])
    reject unless room.present?
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def send_message(data)
    current_user.messages.create(body: data["message"], room_id: params["room_id"])
---
INSERT INTO "messages" ("body", "user_id", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "potato"], ["user_id", 2], ["room_id", 1], ["created_at", "2020-04-26 01:09:21.519955"], ["updated_at", "2020-04-26 01:09:21.519955"]]