app/views/rooms/show.html.erb

SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1 ORDER BY "messages"."created_at" DESC  [["room_id", 2]]
---
  <div  id="messages" data-room-id="<%= @room.id %>">
    <%= render @room.messages.order(created_at: :desc) %>