app/controllers/rooms_controller.rb

  def index
    @rooms= Room.includes(:user).order(:name).all
---
SELECT "rooms".* FROM "rooms" ORDER BY "rooms"."name" ASC
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 3], ["id", 2]]

  def create
    @room= current_user.rooms.create(room_params)
---
INSERT INTO "rooms" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "wee land"], ["user_id", 2], ["created_at", "2020-04-26 01:09:12.400967"], ["updated_at", "2020-04-26 01:09:12.400967"]]

  def show
    @room= Room.includes(:user, :messages).find(params[:id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1  [["room_id", 1]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 2]]

  def edit
    @room = Room.where(user_id: current_user.id).find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."user_id" = $1 AND "rooms"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]

  def update
    @room = Room.where(user_id: current_user.id).find(params[:id]).update(room_params)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."user_id" = $1 AND "rooms"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 2], ["LIMIT", 1]]
UPDATE "rooms" SET "song_file" = $1, "updated_at" = $2 WHERE "rooms"."id" = $3  [["song_file", "Scott Joplin - The Entertainer.mp3"], ["updated_at", "2020-04-27 00:27:43.628333"], ["id", 2]]